package com.example.androidpractice2020

class FilmRepository {
    val arraylist = listOf(
        Film(0, "Довод", "Главный герой — секретный агент, который проходит жестокий тест на надежность и присоединяется к невероятной миссии.",R.drawable.dovod),
        Film(1,"Бэтмен", "По словам автора, это будет самая молодая версия героя, который прошёл через личную трагедию, и всё, что он делает, будет его реакцией на это.", R.drawable.batman),
        Film(2, "Джокер", "Американский психологический триллер режиссёра Тодда Филлипса по сценарию, написанному Филлипсом совместно со Скоттом Сильвером.", R.drawable.joker)
    )

    fun find(id: Int): Film {
        return this.arraylist[id]
    }
}